# Найдите математическое ожидание случайной величины X, распределенной 
# по биномиальному закону с параметрами n =100, р=0.3. 
# M(X) = np
print(f"Математическое ожидание равно {100*0.3:2.0f}")