# Задачу 4 решать с помощью функции. 
# Есть ли статистически значимые различия в росте дочерей и матерей?
# 4) Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169
# Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160
import scipy.stats as stats
import numpy as np
x = np.array([172, 177, 158, 170, 178,175, 164, 160, 169])
y = np.array([173, 175, 162, 174, 175, 168, 155, 170, 160])
x.sort()
y.sort()
a = 0.05
m0 = np.mean(x)
m1 = np.mean(y)
d0 = np.var(x, ddof=1)
d1 = np.var(y, ddof=1)
t = (m1 - m0) / np.sqrt(d1/(len(y)-1)+d0/(len(x)-1))
t0 = stats.t.ppf(a / 2, df=2 * (len(x)-1)) 
t1 = stats.t.ppf(1 - a / 2, df=2 * (len(y)-1))
t_stat, p_value = stats.ttest_ind(y, x)
print(f"H0: m1 = m0, H1: m1 != m0")
print(f"{t0} < {t} < {t1}")
print(f"Т.к. т-наблюдаемое {t:.2f} лежит между {t0:.2f} и {t1:.2f}, то гипотеза H0 не опровергается")
print(f"Более того p-value {p_value:.2f} t-статистики {t_stat:.2f} больше альфа {a},\n\
то нет статистических данных о том, что рост дочерей выше роста матерей")