# Задача 3
# Было проведено исследование научных статей на количество авторов в разные годы.
# Построить 90% и 95% интервалы 
# Решение для 1976 года
z5 = 1.96
z0 = 1.645
q = 7.3
n = 155
x = 4.9
print(1976)
print(95)
print(x+z5*q/n**0.5)
print(x-z5*q/n**0.5)
print(90)
print(x+z0*q/n**0.5)
print(x-z0*q/n**0.5)